<template>
  <div class="nft-legend">
    <div class="legendNav">
      <router-link class="backBtn" to="/collection">
        <img src="/src/assets/images/svg/arrowLeftLegend.svg" alt="">
        <h6>Коллекция</h6>
      </router-link>
      <div class="popupList">
        <img src="/src/assets/images/svg/nikolaTeslaMini.svg" alt="">
      </div>
    </div>

    <div class="legendMain">
      <div class="photo">
        <img class="mobile" src="/src/assets/images/svg/nikolaTeslaMainM.svg" alt="">
        <img class="desktop" src="/src/assets/images/svg/nikolaTeslaMainD.svg" alt="">
        <h1>НИКОЛА <span class="greenText">ТЕСЛА</span></h1>
      </div>
      <div class="graph">
        <img src="/src/assets/images/svg/nikolaTeslaGraph.svg" alt="">
      </div>
    </div>

    <ul class="menu">
      <li class="active" @click="openMenu">
        <h2>БИОГРАФИЯ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>

      <li @click="openMenu">
        <h2>ГИПОТЕЗЫ И ЛЕГЕНДЫ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>

      <li @click="openMenu">
        <h2>НАСЛЕДИЕ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>

      <li @click="openMenu">
        <h2>НАГРАДЫ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>

      <li @click="openMenu">
        <h2>ПАМЯТЬ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>

      <li @click="openMenu">
        <h2>СПИСОК ПАТЕНТОВ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>

      <li @click="openMenu">
        <h2>ФОТОГАЛЕРЕЯ</h2>
        <div class="figure">
          <div class="line1"></div>
          <div class="line2"></div>
        </div>
      </li>

      <li>
        <h3>
          Нико́ла Те́сла — сербско-американский инженер и учёный-физик, изобретатель в области электротехники и радиотехники. По национальности серб, родился в Австрийской империи, вырос в Австро-Венгрии, в последующие годы в основном работал во Франции и США. В 1891 году получил гражданство США.
          Широко известен благодаря своему вкладу в создание устройств, работающих на переменном токе, многофазных систем, синхронного генератора и асинхронного электродвигателя, позволивших совершить так называемый второй этап промышленной революции.
        </h3>

        <h3>
          Также он известен как сторонник теории о существовании эфира — благодаря своим многочисленным опытам и экспериментам, имевшим целью показать наличие эфира как особой формы материи, поддающейся использованию в технике.
        </h3>

        <h3>
          В честь изобретателя названа единица измерения плотности магнитного потока (магнитной индукции) — тесла. Среди многих наград — медали Эллиота Крессона, Джона Скотта, Томаса Эдисона.
        </h3>

        <h3>
          Современники-биографы называют Теслу «человеком, который изобрёл XX век» и «святым заступником» современного электричества.
        </h3>

        <h3>
          После демонстрации радио и победы в «Войне токов» Тесла получил повсеместное признание как выдающийся инженер-электротехник и изобретатель. Ранние работы Теслы проложили путь современной электротехнике, его открытия раннего периода имели инновационное значение.В США по известности Тесла мог конкурировать с любым изобретателем или учёным в истории, а также в массовой культуре.
        </h3>
      </li>
    </ul>
    
    <div class="footerPhoto">
      <img src="/src/assets/images/svg/nikolaTeslaBottom.svg" alt="">
    </div>

    <nft-main-info-page-button-top />
  </div>
</template>

<script>
import nftMainInfoPageButtonTop from "../nft-main-info-page/nft-main-info-page-button-top.vue";

export default {
  name: "nft-legend",
  components: {
    nftMainInfoPageButtonTop
  },
  data() {
    return {
      name: this.$route.params.nameLegend
    }
  },
  methods: {
    openMenu(e) {
      const elem = e.currentTarget
      elem.classList.toggle('active')
    }
  },
  mounted() {
    console.log(this.name)
  }
}
</script>

<style lang="scss">
  .nft-legend {
    display: flex;
    flex-direction: column;
    .legendNav {
      @media (max-width: 1023px) {
        border-top: 1px solid $whiteSmoke;
        border-bottom: 1px solid $whiteSmoke;
        display: flex;
      }

      @media (min-width: 1024px) {
        padding: 93px 109px 58px;
      }

      .backBtn {
        display: inline-flex;
        cursor: pointer;

        @media (max-width: 1023px) {
          padding-left: 12px;
          padding-right: 15px;
          border-right: 1px solid $whiteSmoke;

          img {
            width: 100%;
          }

          > *:last-child {
            display: none;
          }
        }

        @media (min-width: 1024px) {
          gap: 30px;
        }
      }

      .popupList {
        @media (max-width: 1023px) {
          padding: 10px 25px;
        }

        @media (min-width: 1024px) {
          display: none;
        }
      }
    }

    .legendMain {
      display: flex;

      @media (max-width: 1023px) {
        flex-direction: column;
        padding: 32px 16px;
      }

      @media (min-width: 1024px) {
        border-top: 1px solid $whiteSmoke;
        border-bottom: 1px solid $whiteSmoke;
      }

      .photo {
        flex-basis: 66%;
        display: flex;

        @media (max-width: 1023px) {
          flex-direction: column-reverse;
          color: #83F84C;
        }

        @media (min-width: 1024px) {
          flex-direction: column;
          padding: 29px 51px 168px;
          border-right: 1px solid $whiteSmoke;
          align-items: flex-start;

          img + * {
            margin-left: 58px;
          }
        }
      }

      .graph {
        flex-basis: 34%;

        @media (max-width: 1023px) {
          align-self: center;

          > img {
            width: 176px;
          }
        }

        @media (min-width: 1024px) {
          padding: 563px 0 0 31px;
        }
      }
    }

    .menu {
      @media (max-width: 1023px) {
        border-top: 1px solid $whiteSmoke;
        margin: 0 16px;
      }

      > li:nth-child(odd) {
        border-bottom: 1px solid $whiteSmoke;
        display: flex;
        justify-content: space-between;
        gap: 50px;
        cursor: pointer;

        @media (max-width: 1023px) {
          padding: 20px 21px 20px 3px;
        }

        @media (min-width: 1024px) {
          padding: 12px 200px 12px 100px;
        }

        .figure {
          position: relative;
          display: flex;
          align-items: center;
          justify-content: center;

          > div {
            position: absolute;
            background-color: $whiteSmoke;
            @include border-radius(999px);

            @media (max-width: 1023px) {
              width: 19px;
              height: 4px;
            }

            @media (min-width: 1024px) {
              width: 33px;
              height: 9px;
            }

            &.line2{
              transform: rotate(90deg);
            }
          }
        }

        &.active {
          border-bottom: none;

          .figure {
            .line2 {
              display: none;
            }
          }

          & + li {
            display: flex;
          }
        }
      }

      > li:nth-child(even) {
        display: none;
        flex-direction: column;
        gap: 29px;

        @media (max-width: 1023px) {
          padding: 10px 8px 20px;
        }

        @media (min-width: 1024px) {
          padding: 60px 100px 100px;
        }
      }
    }

    .footerPhoto {
      padding: 74px 24px 213px;
      justify-content: center;
      display: inline-flex;
      margin: 0 auto;

      img {
        width: 100%;
      }
    }
  }
</style>